import Input from '@/shared/components/Input';
import styles from '../styles.module.scss';
import classNames from 'classnames';
import Button from '@/shared/components/Button';
import { TabBlock } from '@/shared/components/TabBlock';
import { WalletItem } from './WalletItem';

const WalletWithdraw = () => {
  return (
    <div className={styles.content}>
      <div className={styles.block}>
        <div className={styles.title}>Подтвердите номер телефона для вывода средств</div>
        <Input className="mb-[16px]" mask="+7 999 999 99 99" />
        <Button className={styles.button}>Подтвердить номер</Button>
      </div>
      <div className={styles.block}>
        <div className={styles.title}>Ваш счет</div>
        <div className={styles.check}>
          <div className={classNames(styles.subtitle, 'mb-[4px]')}>Счет</div>
          <div className={styles.check_value}>RUB (17 874 RUB)</div>
        </div>
      </div>
      <div className={styles.block}>
        <div className={styles.title}>Способ вывода</div>
        <div className={styles.cards}>
          <TabBlock selected>
            <svg
              width="51"
              height="16"
              viewBox="0 0 51 16"
              fill="#000"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g clipPath="url(#clip0_222_572)">
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M36.7235 0.659403C35.931 0.346017 34.674 0 33.1197 0C29.1519 0 26.3579 2.10895 26.3407 5.12412C26.3078 7.3487 28.3412 8.58429 29.8621 9.32603C31.4165 10.084 31.9449 10.5787 31.9449 11.2543C31.9291 12.2919 30.6888 12.7702 29.532 12.7702C27.9279 12.7702 27.0684 12.5236 25.7622 11.9463L25.2331 11.6989L24.6709 15.1757C25.6132 15.6036 27.3494 15.9834 29.1519 16C33.3678 16 36.1124 13.9237 36.145 10.7105C36.161 8.94739 35.0873 7.59639 32.7724 6.49242C31.3671 5.78374 30.5065 5.30589 30.5065 4.58078C30.523 3.9216 31.2344 3.24643 32.8207 3.24643C34.1269 3.21336 35.0866 3.52631 35.8136 3.83947L36.177 4.00394L36.7235 0.659403ZM22.1585 15.7692H18.1406L20.6537 0.280762H24.6714L22.1585 15.7692ZM47.0236 0.280273H43.9157C42.9573 0.280273 42.2292 0.560153 41.8157 1.56535L35.8477 15.7685H40.0635C40.0635 15.7685 40.7576 13.8568 40.9068 13.4451H46.0654C46.1808 13.9889 46.5448 15.7685 46.5448 15.7685H50.265L47.0236 0.280273ZM42.0637 10.2802C42.3946 9.39045 43.6678 5.9467 43.6678 5.9467C43.6611 5.96002 43.7133 5.8157 43.7911 5.6009L43.7914 5.6L43.7917 5.59916L43.7919 5.59868C43.9072 5.28 44.0782 4.80753 44.1965 4.46387L44.4773 5.79844C44.4773 5.79844 45.2381 9.50586 45.4034 10.2802H42.0637ZM14.7851 0.280792L10.8502 10.8424L10.4203 8.70092C10.4204 8.70097 10.4204 8.70101 10.4204 8.70105L9.0151 1.58274C8.78375 0.593521 8.07276 0.313423 7.19654 0.280792H0.732149L0.666016 0.593741C2.24258 0.995586 3.65268 1.57464 4.88823 2.29461L8.4694 15.7528H12.7182L19.0336 0.280792H14.7851Z"
                  fill="#121212"
                />
              </g>
              <defs>
                <clipPath id="clip0_222_572">
                  <rect width="51" height="16" fill="white" />
                </clipPath>
              </defs>
            </svg>
          </TabBlock>
          <TabBlock>
            <svg
              width="56"
              height="16"
              viewBox="0 0 56 16"
              fill="#000"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M15.0899 0.0069873V0H20.0737V15.9999H15.0899V6.50475H14.6746L11.7674 15.9999H8.30638L5.39915 6.49776H5.19149H4.98383V15.9999H0V0H4.98383C4.98383 0 7.17117 -0.00698642 7.75262 2.09605C8.29253 4.05936 9.82921 9.50211 9.82921 9.50211H10.2445C10.2861 9.35538 11.7881 4.03141 12.3211 2.10304C12.9014 0.00425428 15.0742 0.00696767 15.0899 0.00698723L15.0899 0.0069873ZM31.1486 1.67684C31.8339 0.13275 33.2944 0 33.2944 0H38.0014V15.9999H33.0175V6.49776H32.6022L29.1412 14.323C28.4559 15.8601 26.9262 15.9999 26.9262 15.9999H22.2192V0H27.2031V9.50211H27.6184L31.1486 1.67684ZM40.2168 7.2666V16.0002H45.2006V10.8998H50.5998C52.9532 10.8998 54.9468 9.38362 55.6874 7.2666H40.2168ZM39.5176 0H50.5997C53.583 0 55.9988 2.43841 55.9988 5.44974C55.9988 5.83401 55.9642 6.20432 55.8881 6.56763H47.3463C46.6265 6.56763 45.9273 6.46982 45.2628 6.28816C42.3348 5.49166 40.0713 3.04626 39.5176 0Z"
                fill="#E1E1E1"
              />
            </svg>
          </TabBlock>
        </div>
      </div>
      <div className={styles.block}>
        WALLET ITEM NAHUY
        <WalletItem />
      </div>
      <div className={styles.block}>
        <div className="flex justify-between	">
          <div className={styles.title}>Введите номер карты</div>
          <div className={styles.cross}>
            <svg
              width="14"
              height="14"
              viewBox="0 0 14 14"
              fill="#000"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M13 1.00031L1 13.0003M1 1.00031L13 13.0003"
                stroke="white"
                strokeOpacity="0.6"
                strokeWidth="2"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
            </svg>
          </div>
        </div>
        <Input
          placeholder="Номер карты"
          mask="9999 9999 9999 9999"
          className="mb-[12px]"
          icon={
            <div className={styles.input_icon}>
              <svg
                width="42"
                height="26"
                viewBox="0 0 42 26"
                fill="#000"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M13.4442 0.228455C16.0725 0.228455 18.4876 1.00896 20.5121 2.3571C20.4055 2.42805 20.299 2.53449 20.1924 2.60544C17.1735 5.23077 15.4687 8.99137 15.4687 13.0003C15.4687 17.0093 17.1735 20.7699 20.1924 23.3952C20.299 23.4662 20.4055 23.5726 20.5121 23.6435C18.4876 24.9917 16.037 25.7722 13.4442 25.7722C6.3764 25.7722 0.658203 20.0603 0.658203 13.0003C0.658203 5.94032 6.3764 0.228455 13.4442 0.228455ZM29.2137 0.228455C36.2815 0.228455 41.9997 5.97579 41.9997 13.0003C41.9997 20.0603 36.2815 25.7722 29.2137 25.7722C26.621 25.7722 24.1703 24.9917 22.1459 23.6435C22.2524 23.5726 22.359 23.4662 22.4655 23.3952C25.4489 20.7699 27.1892 16.9738 27.1892 13.0003C27.1892 8.99137 25.4844 5.23077 22.4655 2.60544C22.359 2.53449 22.2524 2.42805 22.1459 2.3571C24.1703 1.00896 26.5854 0.228455 29.2137 0.228455ZM21.329 2.99569C21.5065 3.10212 21.6486 3.24403 21.8262 3.38594C24.5255 5.72745 26.2303 9.20424 26.2303 13.0358C26.2303 16.9028 24.5255 20.3441 21.8262 22.6857C21.6486 22.8276 21.5065 22.934 21.329 23.0759C21.1514 22.9695 20.9738 22.8276 20.8317 22.6857C18.1325 20.3441 16.4277 16.8674 16.4277 13.0358C16.4277 9.16876 18.1325 5.72745 20.8317 3.38594C21.0093 3.24403 21.1514 3.1376 21.329 2.99569Z"
                  fill="white"
                  fillOpacity="0.6"
                />
              </svg>
            </div>
          }
        />
        <Button elType="outlined" className="w-[100%]">
          Добавить новую карту
        </Button>
      </div>
      <div className={styles.block}>
        <div className={styles.title}>Сумма</div>
        <div className={classNames(styles.subtitle, 'mb-[12px]')}>
          Минимальная сумма вывода в течение дня не более 5 000 RUB
        </div>
        <Input placeholder="Сумма" />
      </div>
      <Button className={styles.button}>Вывести</Button>
    </div>
  );
};

export default WalletWithdraw;
